zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_MSCM.h
#define MSCM_ENEDC_ADD_CM7_1_TCM_MASK            (0x20000000U)
#define MSCM_ENEDC_ADD_CM7_1_TCM_SHIFT           (29U)
#define MSCM_ENEDC_ADD_CM7_1_TCM_WIDTH           (1U)
#define MSCM_ENEDC_ADD_CM7_1_TCM(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_CM7_1_TCM_SHIFT)) & MSCM_ENEDC_ADD_CM7_1_TCM_MASK)
/*! @} */

/*! @name ENEDC1 - Enable Interconnect Error Detection */
/*! @{ */

#define MSCM_ENEDC1_CM7_2_AHBM_MASK              (0x4U)
#define MSCM_ENEDC1_CM7_2_AHBM_SHIFT             (2U)
#define MSCM_ENEDC1_CM7_2_AHBM_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_2_AHBM(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_AHBM_SHIFT)) & MSCM_ENEDC1_CM7_2_AHBM_MASK)

#define MSCM_ENEDC1_CM7_2_AHBP_MASK              (0x8U)
#define MSCM_ENEDC1_CM7_2_AHBP_SHIFT             (3U)
#define MSCM_ENEDC1_CM7_2_AHBP_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_2_AHBP(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_AHBP_SHIFT)) & MSCM_ENEDC1_CM7_2_AHBP_MASK)

#define MSCM_ENEDC1_PFLASH_3_MASK                (0x10U)
#define MSCM_ENEDC1_PFLASH_3_SHIFT               (4U)
#define MSCM_ENEDC1_PFLASH_3_WIDTH               (1U)
#define MSCM_ENEDC1_PFLASH_3(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_PFLASH_3_SHIFT)) & MSCM_ENEDC1_PFLASH_3_MASK)

#define MSCM_ENEDC1_EDMA_S0_MASK                 (0x20U)
#define MSCM_ENEDC1_EDMA_S0_SHIFT                (5U)
#define MSCM_ENEDC1_EDMA_S0_WIDTH                (1U)
#define MSCM_ENEDC1_EDMA_S0(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EDMA_S0_SHIFT)) & MSCM_ENEDC1_EDMA_S0_MASK)

#define MSCM_ENEDC1_EDMA_S1_MASK                 (0x40U)
#define MSCM_ENEDC1_EDMA_S1_SHIFT                (6U)
#define MSCM_ENEDC1_EDMA_S1_WIDTH                (1U)
#define MSCM_ENEDC1_EDMA_S1(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EDMA_S1_SHIFT)) & MSCM_ENEDC1_EDMA_S1_MASK)

#define MSCM_ENEDC1_EN_PRAM2_MASK                (0x400U)
#define MSCM_ENEDC1_EN_PRAM2_SHIFT               (10U)
#define MSCM_ENEDC1_EN_PRAM2_WIDTH               (1U)
#define MSCM_ENEDC1_EN_PRAM2(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EN_PRAM2_SHIFT)) & MSCM_ENEDC1_EN_PRAM2_MASK)

#define MSCM_ENEDC1_ADD_EN_PRAM2_MASK            (0x800U)
#define MSCM_ENEDC1_ADD_EN_PRAM2_SHIFT           (11U)
#define MSCM_ENEDC1_ADD_EN_PRAM2_WIDTH           (1U)
#define MSCM_ENEDC1_ADD_EN_PRAM2(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_ADD_EN_PRAM2_SHIFT)) & MSCM_ENEDC1_ADD_EN_PRAM2_MASK)

#define MSCM_ENEDC1_CM7_2_TCM_MASK               (0x4000U)
#define MSCM_ENEDC1_CM7_2_TCM_SHIFT              (14U)
#define MSCM_ENEDC1_CM7_2_TCM_WIDTH              (1U)
#define MSCM_ENEDC1_CM7_2_TCM(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_TCM_SHIFT)) & MSCM_ENEDC1_CM7_2_TCM_MASK)

#define MSCM_ENEDC1_ADD_CM7_2_TCM_MASK           (0x8000U)
#define MSCM_ENEDC1_ADD_CM7_2_TCM_SHIFT          (15U)
#define MSCM_ENEDC1_ADD_CM7_2_TCM_WIDTH          (1U)
#define MSCM_ENEDC1_ADD_CM7_2_TCM(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_ADD_CM7_2_TCM_SHIFT)) & MSCM_ENEDC1_ADD_CM7_2_TCM_MASK)

#define MSCM_ENEDC1_USDHC_MASK                   (0x10000U)
#define MSCM_ENEDC1_USDHC_SHIFT                  (16U)
#define MSCM_ENEDC1_USDHC_WIDTH                  (1U)
#define MSCM_ENEDC1_USDHC(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_USDHC_SHIFT)) & MSCM_ENEDC1_USDHC_MASK)
/*! @} */

/*! @name IAHBCFGREG - AHB Gasket Configuration */
/*! @{ */

#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_MASK     (0x1U)
#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_SHIFT    (0U)
#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_WIDTH    (1U)
#define MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT(x)       (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_EMAC_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_MASK (0x2U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_SHIFT (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_MASK (0x4U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_SHIFT (2U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_MASK      (0x8U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_SHIFT     (3U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_WIDTH     (1U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_MASK      (0x10U)
#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_SHIFT     (4U)
#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_WIDTH     (1U)
#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_MASK     (0x20U)
#define MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_SHIFT    (5U)
#define MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_WIDTH    (1U)
#define MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT(x)       (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_QSPI_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_MASK (0x40U)
#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_SHIFT (6U)
#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_MASK (0x80U)
#define MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_SHIFT (7U)
#define MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_1_AHBS_DIS_WR_OPT_MASK)

