zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_MSCM.h
#define MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_MASK (0x100U)
#define MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_SHIFT (8U)
#define MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_2_AHBS_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_MASK    (0x200U)
#define MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_SHIFT   (9U)
#define MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_AIPS1_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_MASK    (0x400U)
#define MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_SHIFT   (10U)
#define MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_AIPS2_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_MASK    (0x800U)
#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_SHIFT   (11U)
#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_MASK    (0x1000U)
#define MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_SHIFT   (12U)
#define MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_USDHC_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_MASK    (0x2000U)
#define MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_SHIFT   (13U)
#define MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_MASK    (0x4000U)
#define MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_SHIFT   (14U)
#define MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_PRAM1_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_MASK (0x8000U)
#define MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_SHIFT (15U)
#define MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT(x)   (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_MASK    (0x10000U)
#define MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_SHIFT   (16U)
#define MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_PRAM2_DIS_WR_OPT_MASK)
/*! @} */

/*! @name IRSPRC - Interrupt Router Shared Peripheral Routing Control */
/*! @{ */

#define MSCM_IRSPRC_M7_0_MASK                    (0x1U)
#define MSCM_IRSPRC_M7_0_SHIFT                   (0U)
#define MSCM_IRSPRC_M7_0_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_0(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_0_SHIFT)) & MSCM_IRSPRC_M7_0_MASK)

#define MSCM_IRSPRC_M7_1_MASK                    (0x2U)
#define MSCM_IRSPRC_M7_1_SHIFT                   (1U)
#define MSCM_IRSPRC_M7_1_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_1(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_1_SHIFT)) & MSCM_IRSPRC_M7_1_MASK)

#define MSCM_IRSPRC_M7_2_MASK                    (0x4U)
#define MSCM_IRSPRC_M7_2_SHIFT                   (2U)
#define MSCM_IRSPRC_M7_2_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_2(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_2_SHIFT)) & MSCM_IRSPRC_M7_2_MASK)

#define MSCM_IRSPRC_LOCK_MASK                    (0x8000U)
#define MSCM_IRSPRC_LOCK_SHIFT                   (15U)
#define MSCM_IRSPRC_LOCK_WIDTH                   (1U)
#define MSCM_IRSPRC_LOCK(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_LOCK_SHIFT)) & MSCM_IRSPRC_LOCK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MSCM_Register_Masks */

/*!
 * @}
 */ /* end of group MSCM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K358_MSCM_H_) */
